app/controllers/blogposts_controller.rb

    def index
        blogs = Blogpost.all
---
SELECT "blogposts".* FROM "blogposts"

    def create
        blog = Blogpost.create(
            firstname: params[:firstname],
            lastname: params[:lastname],
            subject: params[:subject],
            content: params[:content],
            uuid: params[:uuid]
        )
---
INSERT INTO "blogposts" ("subject", "content", "firstname", "lastname", "uuid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def show
        post = Blogpost.find_by(id: params[:id])
---
SELECT "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update

        post = Blogpost.find_by(id: params[:id])
        post.update(subject: params[:subject], content: params[:content])
---
SELECT "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "blogposts" SET "subject" = ?, "content" = ?, "updated_at" = ? WHERE "blogposts"."id" = ?  [["subject", "test"], ["content", "test"], ["updated_at", "2020-02-18 00:27:20.645816"], ["id", 3]]

    def destroy
        post= Blogpost.find_by(id: params[:id]).destroy
---
DELETE FROM "blogposts" WHERE "blogposts"."id" = ?  [["id", 3]]
SELECT "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]