app/controllers/blogposts_controller.rb

SELECT "blogposts".* FROM "blogposts"
---
    def create
        blogs = Blogpost.all